**Plan Output** :sparkles: :rocket:
```
Building .terraspace-cache/canadacentral/dev/stacks/bcp
Built in .terraspace-cache/canadacentral/dev/stacks/bcp
Current directory: .terraspace-cache/canadacentral/dev/stacks/bcp
=> terraform init -no-color -get -input=false >> /tmp/terraspace/log/init/bcp.log
=> terraform plan -no-color -input=false
module.bcp_la.module.caf_naming_bcp_la.random_string.singlealphanum: Refreshing state... [id=p]
module.bcp_st.module.caf_naming_bcp_st.random_string.fullrandom: Refreshing state... [id=lo78vs6osktay5dvbof3ys2c]
module.bcp_st.module.caf_naming_bcp_st.random_string.singlealphanum: Refreshing state... [id=h]
module.bcp_la.module.caf_naming_bcp_la.random_string.singlechar: Refreshing state... [id=e]
module.bcp_la.module.caf_naming_bcp_la.random_string.fullrandom: Refreshing state... [id=hcrqf1xbm8uxn99flovc392ntoe7ebvcpd14o1weubsxpstpf8bknz62250ddhk]
module.bcp_rg2.module.caf_naming_bcp_rg.random_string.fullrandom: Refreshing state... [id=uhcr33qru0apd2dobqnpj5tge6cz3rmxob1xcrzltlsdv636wvz7iizuuyjdy0ecia1ijnqxyxmrvbg5]
module.bcp_st.module.caf_naming_bcp_st.random_string.singlechar: Refreshing state... [id=v]
module.bcp_rg2.module.caf_naming_bcp_rg.random_string.singlealphanum: Refreshing state... [id=0]
module.bcp_rg.module.caf_naming_bcp_rg.random_string.singlechar: Refreshing state... [id=w]
module.bcp_rg.module.caf_naming_bcp_rg.random_string.singlealphanum: Refreshing state... [id=7]
module.bcp_rg.module.caf_naming_bcp_rg.random_string.fullrandom: Refreshing state... [id=coljm10lbkiam3wo4qjzjna3kt6853d7wjkmi3cses2rsq800ded8goaf3e6gcq8iuof773xlhghpooy]
module.bcp_rg2.module.caf_naming_bcp_rg.random_string.singlechar: Refreshing state... [id=d]
module.bcp_rg2.azurerm_resource_group.bcp_rg: Refreshing state... [id=/subscriptions/6373a576-34f3-45e5-b060-222a851b6762/resourceGroups/rg-bcp2-test]
module.bcp_rg.azurerm_resource_group.bcp_rg: Refreshing state... [id=/subscriptions/6373a576-34f3-45e5-b060-222a851b6762/resourceGroups/rg-bcp-test]
module.bcp_la.azurerm_log_analytics_workspace.bcp_la: Refreshing state... [id=/subscriptions/6373a576-34f3-45e5-b060-222a851b6762/resourceGroups/rg-bcp2-test/providers/Microsoft.OperationalInsights/workspaces/bcplogs]
module.bcp_st.azurerm_storage_account.bcp_st: Refreshing state... [id=/subscriptions/6373a576-34f3-45e5-b060-222a851b6762/resourceGroups/rg-bcp-test/providers/Microsoft.Storage/storageAccounts/strgbcptesttest]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:
  # module.bcp_la.azurerm_log_analytics_workspace.bcp_la must be replaced
-/+ resource "azurerm_log_analytics_workspace" "bcp_la" {
      ~ id                                 = "/subscriptions/6373a576-34f3-45e5-b060-222a851b6762/resourceGroups/rg-bcp2-test/providers/Microsoft.OperationalInsights/workspaces/bcplogs" -> (known after apply)
      ~ name                               = "bcplogs" -> "bcplogs2" # forces replacement
      ~ primary_shared_key                 = (sensitive value)
      + reservation_capacity_in_gb_per_day = (known after apply)
      ~ secondary_shared_key               = (sensitive value)
        tags                               = {
            "environment" = "test"
        }
      ~ workspace_id                       = "4f4430c7-a1be-438f-84cd-2a858d6dfc21" -> (known after apply)
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 0 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```